Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/mental_health/mental_health_professionals.html.txt.tmx
Source language: en
Languages: ga

source: Occupational therapy aims to enable the person to have as independent, productive and satisfying a lifestyle as possible
ga: Is é an aidhm atá le teiripe shaothair ná cur ar chumas an duine stíl mhaireachtála atá chomh neamhspleách, chomh táirgiúil agus chomh sásúil agus is féidir a bheith aige

source: Treatment can include self care, personal development, mobility and access, skills and training, home management, disability awareness, work preparation, directed play, stress management and compensatory techniques
ga: Is é a d’fhéadfadh a bheith i gceist le cóireáil ná féinchúram, forbairt phearsanta, soghluaisteacht agus rochtain, scileanna agus oiliúint, bainistíocht bhaile, feasacht ar mhíchumas, ullmhúchán don obair, súgradh stiúrtha, bainistíocht struis agus teicnící cúitimh

source: Vocational training is a service provided for people whose lives have been disrupted by mental health problems and who wish to make a fresh start
ga: Is é is gairmoiliúint ann ná seirbhís a chuirtear ar fáil do dhaoine ar chuir fadhbanna meabhairshláinte isteach ar a saol agus ar mian leo tús nua a dhéanamh

source: It aims to provide participants with the skills, knowledge and attitudes necessary for progression into employment, further training, education, and self-employment
ga: Is é an aidhm atá léi na scileanna, an t-eolas agus an dearcadh is gá a thabhairt do rannpháirtithe chun gur féidir leo dul i mbun fostaíochta, breisoiliúna, oideachais agus féinfhostaíochta

source: It also aims to provide participants with other work opportunities, the opportunity to rebuild self-confidence and restore self-worth and the opportunity to make new friends and develop hobbies and pastimes
ga: Is é an aidhm atá léi freisin ná deiseanna eile oibre a thabhairt do rannpháirtithe, deis a thabhairt dóibh féinmhuinín a athchothú agus féinluach a athghnóthú agus deis a thabhairt dóibh cairde nua a dhéanamh agus cineálacha caitheamh aimsire a fhorbairt

source: A Vocational Training Centre provides activities such as woodwork, metalwork, office procedures, arts and crafts and life skills (for example, interpersonal skills and personal development)
ga: Soláthraíonn Ionad Gairmoiliúna gníomhaíochtaí ar nós adhmadóireachta, miotalóireachta, nósanna imeachta oifige, ealaíon agus ceardaíochta agus scileanna saoil (e.g., scileanna idirphearsanta agus forbairt phearsanta)

source: An individual programme is agreed with each trainee
ga: Déantar clár ar leith a aontú le gach oiliúnaí

source: Referral is usually through a professional such as a psychiatrist, but self-referral is also possible
ga: Is trí ghairmí ar nós síciatraí a dhéantar an t-atreorú de ghnáth, ach is féidir le duine é féin a atreorú freisin

source: While some trainers are mental health professionals, such as psychiatric nurses, others may not have specific medical training
ga: ina ngairmithe meabhairshláinte, amhail altraí síciatracha, níl oiliúint mhíochaine ar leith déanta ag gach duine acu

source: You do not have to pay to use the services of mental health professionals who work in the public health system
ga: Ní gá duit íoc as úsáid a bhaint as seirbhísí gairmithe meabhairshláinte a oibríonn sa chóras sláinte poiblí

source: If you decide to use private mental health professional services, the cost will vary greatly
ga: Beidh difríocht shuntasach sa chostas má chinneann tú úsáid a bhaint as seirbhísí gairmithe príobháideacha meabhairshláinte

source: You should check with the individuals involved for more details
ga: Ba chóir duit dul i dteagmháil leis na daoine atá páirteach le haghaidh tuilleadh faisnéise a fháil

source: Contact your GP to access to mental health professionals, both public and private
ga: Déan teagmháil le do dhochtúir teaghlaigh chun rochtain a fháil air ghairmithe meabhairshláinte, idir ghairmithe poiblí agus ghairmithe príobháideacha

source: Some private counsellors, psychologists, etc., can be approached directly
ga: Is féidir teagmháil dhíreach a dhéanamh le roinnt comhairleoirí, síceolaithe, etc., atá príobháideach
